Repository: msdx/gradle-translation
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: "$project.group:$project.name" (for root project of analysed hierarchy; left to Sonar Runner otherwise)
zh_cn: "$project.group:$project.name" （所分析的层次结构的根项目，否则留给 Sonar Runner 处理）

source: 'build' never runs before 'clean'.
zh_cn: 'build' 永远不会在 'clean' 前面执行。

source: (But, once you've migrated, it might be a good idea to move away from a .classpath file and use Gradle's dependency management features directly.)
zh_cn: （但是，一旦你已经迁移，远离 .classpath 文件，直接使用 Gradle 的依赖管理功能会是一个好主意。）

source: (In the case of dependency entries, this is also the default behavior.) Other sections of the .classpath file will be either left as-is or merged.
zh_cn: (对于依赖项，这也是默认行为。)其他部分的.classpath文件将会被合并或者保留。

source: (In the case of dependency entries, this is also the default behavior.) Other sections of the module file will be either left as-is or merged.
zh_cn: (对于依赖项，这也是默认行为。)其他部分的模块文件将会被保留或合并。

source: (It does detect changes to the compile class path itself.) This makes it less suitable for multi-project builds.
zh_cn: (它本身不会去检测编译类路径的更改。）这使得它不太适合于多项目的构建。

source: (See Section 13.4.2, “Extra properties” for more information on extra properties.)
zh_cn: （有关额外属性的更多信息，请参见第 13.4.2 节，“额外属性”。）

source: (The Cygwin runtime is not yet modelled as part of the Platform, but will be in the future.)
zh_cn: （Cywgin运行时还不能模拟为Platform的一部分，但以后将会实现。）

source: ../groovydoc/org/gradle/api/plugins/sonar/model/SonarDatabase.html
zh_cn: ../groovydoc/org/gradle/api/plugins/sonar/model/SonarRootModel.html

source: ../groovydoc/org/gradle/api/plugins/sonar/model/SonarProject.html
zh_cn: ../groovydoc/org/gradle/api/plugins/sonar/model/SonarRootModel.html

source: ../groovydoc/org/gradle/api/plugins/sonar/model/SonarProjectModel.html
zh_cn: ../groovydoc/org/gradle/api/plugins/sonar/model/SonarRootModel.html

source: ../groovydoc/org/gradle/api/plugins/sonar/model/SonarProperty.html
zh_cn: ../groovydoc/org/gradle/api/plugins/sonar/model/SonarRootModel.html

source: ../groovydoc/org/gradle/api/plugins/sonar/model/SonarServer.html
zh_cn: ../groovydoc/org/gradle/api/plugins/sonar/model/SonarRootModel.html

source: 10.1. Building a WAR file
zh_cn: 10.1. 构建一个WAR文件

source: 10.2. Running your web application
zh_cn: 10.2.运行您的 web 应用程序

source: 10.3. Summary
zh_cn: 10.3.总结

source: 12.1. Task Tree
zh_cn: 12.1. 任务树

source: 12.2. Favorites
zh_cn: 12.2. 收藏夹

source: 12.3. Command Line
zh_cn: 12.3. 命令行

source: 12.4. Setup
zh_cn: 12.4. 设置

source: 13.1. The Gradle build language
zh_cn: 13.1. Gradle 构建语言

source: 13.2.1. Standard project properties
zh_cn: 13.2.1. 标准project属性

source: 13.2. The Project API
zh_cn: 13.2. Project API

source: 13.3. The Script API
zh_cn: 13.3. Script API

source: 13.4.1. Local variables
zh_cn: 13.4.1. 局部变量局部

source: 13.4.2. Extra properties
zh_cn: 13.4.2. 额外属性

source: 13.4. Declaring variables
zh_cn: 13.4. 声明变量

source: 13.5.2. Property accessors
zh_cn: 13.5.2. 属性访问器

source: 13.5.3. Optional parentheses on method calls
zh_cn: 13.5.3 括号可选的方法调用

source: 13.5.4. List and map literals
zh_cn: 13.5.4. List 和 Map

source: 13.5.5. Closures as the last parameter in a method
zh_cn: 13.5.5.作为方法最后一个参数的闭包

source: 13.5.6. Closure delegate
zh_cn: 13.5.6. 闭包委托（delegate）

source: 13.5. Some Groovy basics
zh_cn: 13.5.一些 Groovy 的基础知识

source: 14.1. Directory creation
zh_cn: 14.1. 创建目录

source: 14.2.1. Checking for project properties
zh_cn: 14.2.1.检查项目的属性

source: 14.2. Gradle properties and system properties
zh_cn: 14.2. Gradle 属性和系统属性

source: 14.3. Configuring the project using an external build script
zh_cn: 14.3. 使用外部构建脚本配置项目

source: 14.4. Configuring arbitrary objects
zh_cn: 14.4. 配置任意对象

source: 14.5. Configuring arbitrary objects using an external script
zh_cn: 14.5. 使用外部脚本配置任意对象

source: 14.6. Caching
zh_cn: 14.6. 缓存

source: 15.1. Defining tasks
zh_cn: 15.1. 定义任务

source: 15.10. Task rules
zh_cn: 15.10. 任务规则

source: 15.11. Finalizer tasks
zh_cn: 15.11. 析构器任务

source: 15.12. Summary
zh_cn: 15.12. 总结

source: 15.2. Locating tasks
zh_cn: 15.2. 查找任务

source: 15.3. Configuring tasks
zh_cn: 15.3. .配置任务

source: 15.4. Adding dependencies to a task
zh_cn: 15.4. 向任务添加依赖

source: 15.5. Ordering tasks
zh_cn: 15.5. 任务排序

source: 15.6. Adding a description to a task
zh_cn: 15.6. 向任务添加描述

source: 15.7. Replacing tasks
zh_cn: 15.7. 替换任务

source: 15.8.1. Using a predicate
zh_cn: 15.8.1. 使用断言

source: 15.8.2. Using StopExecutionException
zh_cn: 15.8.2. 使用 StopExecutionException

source: 15.8.3. Enabling and disabling tasks
zh_cn: 15.8.3. 启用和禁用任务

source: 15.8. Skipping tasks
zh_cn: 15.8. 跳过任务

source: 15.9.1. Declaring a task's inputs and outputs
zh_cn: 15.9.1. 声明一个任务的输入和输出

source: 15.9.2. How does it work?
zh_cn: 15.9.2. 它是怎么实现的？

source: 15.9. Skipping tasks that are up-to-date
zh_cn: 15.9. 跳过处于最新状态的任务

source: 16.1. Locating files
zh_cn: 16.1. 定位文件

source: 16.2. File collections
zh_cn: 16.2. 文件集合

source: 16.3. File trees
zh_cn: 16.3. 文件树

source: 16.4. Using the contents of an archive as a file tree
zh_cn: 16.4. 使用归档文件的内容作为文件树

source: 16.5. Specifying a set of input files
zh_cn: 16.5. 指定一组输入文件

source: 16.6.1. Renaming files
zh_cn: 16.6.1. 重命名文件

source: 16.6.2. Filtering files
zh_cn: 16.6. 过滤文件

source: 16.6.3. Using the CopySpec class
zh_cn: 16.6.3. 使用CopySpec类

source: 16.6. Copying files
zh_cn: 16.6. 复制文件

source: 16.7. Using the Sync task
zh_cn: 16.7. 使用Sync任务

source: 16.8.1. Archive naming
zh_cn: 16.8.1. 归档命名

source: 16.8.2. Sharing content between multiple archives
zh_cn: 16.8.2. 共享多个归档之间的内容

source: 16.8. Creating archives
zh_cn: 16.8. 创建归档文件

source: 17.1.1. Using custom Ant tasks in your build
zh_cn: 17.1.1. 在您的构建中使用自定义 Ant 任务

source: 17.1. Using Ant tasks and types in your build
zh_cn: 17.1. 在构建中使用 Ant 任务和类型

source: 17.2. Importing an Ant build
zh_cn: 17.2. 导入 Ant 构建

source: 17.3. Ant properties and references
zh_cn: 17.3. Ant 属性和引用

source: 18.1. Choosing a log level
zh_cn: 18.1. 选择一个日志级别

source: 18.2. Writing your own log messages
zh_cn: 18.2. 编写自己的日志消息

source: 18.3. Logging from external tools and libraries
zh_cn: 18.3. 使用外部的工具和类库来记录日志

source: 18.4. Changing what Gradle logs
zh_cn: 18.4. 改变 Gradle 日志

source: 19.1. Enter the daemon
zh_cn: 19.1. 走进守护进程

source: 19.2. Reusing and expiration of daemons
zh_cn: 19.2. 重用和失效的守护程序

source: 19.3. Usage and troubleshooting
zh_cn: 19.3. 用法和故障排除

source: 19.4. Configuring the daemon
zh_cn: 19.4. 配置守护进程

source: 2.1. Features
zh_cn: 2.1. 特性

source: 20.1.1. Forked java processes
zh_cn: 20.1.1. Forked java 进程

source: 20.1. Configuring the build environment via gradle.properties
zh_cn: 20.1. 通过 gradle.properties 配置构建环境

source: 20.2.1. NTLM Authentication
zh_cn: 20.2.1. NTLM 身份验证

source: 20.2. Accessing the web via a proxy
zh_cn: 20.2. 通过代理访问网站

source: 21.1. Applying plugins
zh_cn: 21.1. 应用插件

source: 21.2. What plugins do
zh_cn: 21.2. 插件都做了什么

source: 21.3. Conventions
zh_cn: 21.3. 约定

source: 21.4. More on plugins
zh_cn: 21.4. 更多关于插件的内容

source: 22.1. Language plugins
zh_cn: 22.1. 语言插件

source: 22.2. Incubating language plugins
zh_cn: 22.2. 正在孵化的语言插件

source: 22.3. Integration plugins
zh_cn: 22.3. 集成插件

source: 22.4. Incubating integration plugins
zh_cn: 22.4. 孵化中的集成插件

source: 22.5. Software development plugins
zh_cn: 22.5. 软件开发插件

source: 22.6. Incubating software development plugins
zh_cn: 22.6. 孵化中的软件开发插件

source: 22.7. Base plugins
zh_cn: 22.7. 基本插件

source: 22.8. Third party plugins
zh_cn: 22.8. 第三方插件

source: 23.1. Usage
zh_cn: 23.1. 用法

source: 23.10. Resources
zh_cn: 23.10. 资源

source: 23.12.1. Test execution
zh_cn: 23.12.1. 测试执行

source: 23.12.2. Debugging
zh_cn: 23.12.2. 调试

source: 23.12.3. Test filtering
zh_cn: 23.12.3. 测试过滤

source: 23.12.4. Single test execution via System Properties
zh_cn: 23.12.4. 通过系统属性执行单一的测试

source: 23.12.5. Test detection
zh_cn: 23.12.5. 测试检测

source: 23.12.6. Test grouping
zh_cn: 23.12.6. 测试分组

source: 23.12.7.1. TestNG parameterized methods and reporting
zh_cn: 23.12.7.1. TestNG 参数化方法和报告

source: 23.12.7. Test reporting
zh_cn: 23.12.7. 测试报告

source: 23.12.8. Convention values
zh_cn: 23.12.8. 常规值

source: 23.14. Uploading
zh_cn: 23.14. 上传

source: 23.2. Source sets
zh_cn: 23.2 源集

source: 23.3. Tasks
zh_cn: 23.3. 任务

source: 23.4.1. Changing the project layout
zh_cn: 23.4.1. 更改项目布局

source: 23.4. Project layout
zh_cn: 23.4. 项目布局

source: 23.5. Dependency management
zh_cn: 23.5. 依赖管理

source: 23.6. Convention properties
zh_cn: 23.6. 常规属性

source: 23.7.1. Source set properties
zh_cn: 23.7.1. 源集属性

source: 23.7.2. Defining new source sets
zh_cn: 23.7.2. 定义新的源集

source: 23.7.3. Some source set examples
zh_cn: 23.7.3. 一些源集的范例

source: 23.7. Working with source sets
zh_cn: 23.7. 使用源集

source: 23.9. Clean
zh_cn: 23.9. 清理

source: 24.1. Usage
zh_cn: 24.1. 用法

source: 24.2. Tasks
zh_cn: 24.2. 任务

source: 24.3.1. Changing the project layout
zh_cn: 24.3.1. 更改项目布局

source: 24.3. Project layout
zh_cn: 24.3. 项目布局

source: 24.4. Dependency management
zh_cn: 24.4. 依赖管理

source: 24.5. Automatic configuration of groovyClasspath
zh_cn: 24.5. groovyClasspath 的自动配置

source: 24.6. Convention properties
zh_cn: 24.6. 常规属性

source: 24.7. Source set properties
zh_cn: 24.7. source set 属性

source: 25.1. Usage
zh_cn: 25.1. 用法

source: 25.10. Incremental compilation
zh_cn: 25.10. 增量编译

source: 25.11. Eclipse Integration
zh_cn: 25.11. eclipse 集成

source: 25.12. IntelliJ IDEA Integration
zh_cn: 25.12. IntelliJ 集成

source: 25.2. Tasks
zh_cn: 25.2. 任务

source: 25.3.1. Changing the project layout
zh_cn: 25.3.1. 更改项目布局

source: 25.3. Project layout
zh_cn: 25.3. 项目布局

source: 25.4. Dependency management
zh_cn: 25.4. 依赖管理

source: 25.5. Automatic configuration of scalaClasspath
zh_cn: 25.5. scalaClasspath 的自动配置

source: 25.6. Convention properties
zh_cn: 25.6. 公约属性

source: 25.7. Source set properties
zh_cn: 25.7. source set 属性

source: 25.9. Compiling in external process
zh_cn: 25.9. 在外部进程中编译

source: 26.1. Usage
zh_cn: 26.1. 用法

source: 26.2. Tasks
zh_cn: 26.2. 任务

source: 26.3. Project layout
zh_cn: 26.3. 项目布局

source: 26.4. Dependency management
zh_cn: 26.4. 依赖管理

source: 26.5. Convention properties
zh_cn: 26.5. 公约属性

source: 26.7. Customizing
zh_cn: 26.7. 自定义

source: 27.1. Usage
zh_cn: 27.1. 用法

source: 27.3. Project layout
zh_cn: 27.3. 项目布局

source: 27.4. Dependency management
zh_cn: 27.4. 依赖管理

source: 27.5. Convention properties
zh_cn: 27.5. 公约属性

source: 27.7. Customizing
zh_cn: 27.7. 自定义

source: 27.8. Using custom descriptor file
zh_cn: 27.8. 使用自定义的描述符文件

source: 28.1. Usage
zh_cn: 28.1. 用法

source: 28.2. Tasks
zh_cn: 28.2. 任务

source: 28.3. Project layout
zh_cn: 28.3. 项目布局

source: 28.4. Dependency management
zh_cn: 28.4. 依赖管理

source: 28.5. Convention properties
zh_cn: 28.5. 公约属性

source: 29.1. Usage
zh_cn: 29.1. 用法

source: 29.3. Project layout
zh_cn: 29.3. 项目布局

source: 29.4. Dependency management
zh_cn: 29.4. 依赖管理

source: 29.5. Configuration
zh_cn: 29.5. 配置

source: 30.1. Usage
zh_cn: 30.1. 用法

source: 30.2. Tasks
zh_cn: 30.2. 任务

source: 30.3. Project layout
zh_cn: 30.3. 项目布局

source: 30.4. Dependency management
zh_cn: 30.4. 依赖管理

source: 30.5. Configuration
zh_cn: 30.5. 配置

source: 31.1. Usage
zh_cn: 31.1. 用法

source: 31.2. Tasks
zh_cn: 31.2. 任务

source: 31.3. Dependency management
zh_cn: 31.3. 依赖管理

source: 31.4. Configuration
zh_cn: 31.4. 配置

source: 32.1. Usage
zh_cn: 32.1. 用法

source: 32.2. Tasks
zh_cn: 32.2. 任务

source: 32.3. Dependency management
zh_cn: 32.3. 依赖管理

source: 32.4. Configuration
zh_cn: 32.4. 配置

source: 33.1. Usage
zh_cn: 33.1. 用法

source: 33.2. Tasks
zh_cn: 33.2. 任务

source: 33.3. Dependency management
zh_cn: 33.3. 依赖管理

source: 33.4. Configuration
zh_cn: 33.4. 配置

source: 34.1. Getting Started
zh_cn: 34.1. 入门

source: 34.2. Configuring the JaCoCo Plugin
zh_cn: 34.2. 配置 JaCoCo 插件

source: 34.3. JaCoCo Report configuration
zh_cn: 34.3. JaCoCo 报告配置

source: 34.4. JaCoCo specific task configuration
zh_cn: 34.4. JaCoCo 的特定任务配置

source: 34.5. Tasks
zh_cn: 34.5. 任务

source: 34.6. Dependency management
zh_cn: 34.6. 依赖管理

source: 35.1. Usage
zh_cn: 35.1. 用法

source: 35.2. Analyzing Multi-Project Builds
zh_cn: 35.2. 分析多项目构建

source: 35.3. Analyzing Custom Source Sets
zh_cn: 35.3. 分析自定义的Source Sets

source: 35.4. Analyzing languages other than Java
zh_cn: 35.4. 分析非 Java 语言

source: 35.5. Setting Custom Sonar Properties
zh_cn: 35.5. 设置自定义的 Sonar 属性

source: 35.6. Configuring Sonar Settings from the Command Line
zh_cn: 35.6. 从命令行配置 Sonar 的设置

source: 35.7. Tasks
zh_cn: 35.7. 任务

source: 36.1. Plugin Status and Compatibility
zh_cn: 36.1. 插件状态和兼容性

source: 36.10. Tasks
zh_cn: 36.10. 任务

source: 36.2. Getting Started
zh_cn: 36.2. 入门

source: 36.3. Configuring the Sonar Runner
zh_cn: 36.3. 配置 Sonar Runner

source: 36.4. Analyzing Multi-Project Builds
zh_cn: 36.4. 分析多项目构建

source: 36.5. Analyzing Custom Source Sets
zh_cn: 36.5. 分析自定义的Source Sets

source: 36.6. Analyzing languages other than Java
zh_cn: 36.6. 分析非 Java 语言

source: 36.7. More on configuring Sonar properties
zh_cn: 36.7. 更多关于配置 Sonar 的属性

source: 36.8. Setting Sonar Properties from the Command Line
zh_cn: 36.8. 从命令行设置 Sonar 属性。

source: 36.9. Executing Sonar Runner in a separate process
zh_cn: 36.9. 在一个单独的进程中执行 Sonar Runner

source: 37.1. Usage
zh_cn: 37.1. 用法

source: 37.2. Implicitly applied plugins
zh_cn: 37.2. 隐式应用插件

source: 37.3. Tasks
zh_cn: 37.3. 任务

source: 37.4. Dependency management
zh_cn: 37.4. 依赖管理

source: 37.5.1. Convention properties
zh_cn: 37.5.1. 约定属性

source: 37.5.2. Convention methods
zh_cn: 37.5.2. 约定方法

source: 37.5. Convention object
zh_cn: 37.5. 约定对象

source: 38.1. Usage
zh_cn: 38.1. 用法

source: 38.2. Tasks
zh_cn: 38.2. 任务

source: 38.3. Configuration
zh_cn: 38.3. 配置

source: 38.4.1.1. Disabling merging with a complete overwrite
zh_cn: 38.4.1.1. 禁用完全覆盖的合并

source: 38.4.1. Merging
zh_cn: 38.4.1. 合并

source: 38.4.2.1. Partial overwrite of existing content
zh_cn: 38.4.2.1. 部分重写现有内容

source: 38.4.2.2. Modifying the fully populated domain objects
zh_cn: 38.4.2.2. 修改完全填充的域对象

source: 38.4.2.3. Modifying the XML representation
zh_cn: 38.4.2.3. 修改 XML 的表示形式

source: 38.4.2. Hooking into the generation lifecycle
zh_cn: 38.4.2. Hooking到生成的生命周期中

source: 38.4. Customizing the generated files
zh_cn: 38.4. 自定义生成的文件

source: 39.1. Usage
zh_cn: 39.1. 用法

source: 39.2. Tasks
zh_cn: 39.2. 任务

source: 39.3. Configuration
zh_cn: 39.3. 配置

source: 39.4.1.1. Disabling merging with a complete overwrite
zh_cn: 39.4.1.1. 禁用完整覆盖的合并

source: 39.4.1. Merging
zh_cn: 39.4.1. 合并

source: 39.4.2.1. Partial overwrite of existing content
zh_cn: 39.4.2.1. 部分重写现有内容

source: 39.4.2.2. Modifying the fully populated domain objects
zh_cn: 39.4.2.2. 修改完全填充的域对象

source: 39.4.2.3. Modifying the XML representation
zh_cn: 39.4.2.3. 修改 XML 的表示形式

source: 39.4.2. Hooking into the generation lifecycle
zh_cn: 39.4.2. Hooking到生成的生命周期中

source: 39.4. Customizing the generated files
zh_cn: 39.4. 自定义生成的文件

source: 39.5. Further things to consider
zh_cn: 39.5. 进一步要考虑的事项

source: 40.1. Usage
zh_cn: 40.1. 用法

source: 40.2. Tasks
zh_cn: 40.2. 任务

source: 40.3. Project layout
zh_cn: 40.3. 项目布局

source: 40.4. Dependency management
zh_cn: 40.4. 依赖管理

source: 40.5. Convention properties
zh_cn: 40.5. 约定属性

source: 40.6. Source set properties
zh_cn: 40.6. Source set 属性

source: 41.1. Usage
zh_cn: 41.1. 用法

source: 41.2. Tasks
zh_cn: 41.2. 任务

source: 41.3. Project layout
zh_cn: 41.3. 项目布局

source: 41.4. Dependency management
zh_cn: 41.4. 依赖管理

source: 41.5. Convention properties
zh_cn: 41.5. 约定属性

source: 42.1. Usage
zh_cn: 42.1. 用法

source: 42.2. Configuration
zh_cn: 42.2. 配置

source: 43.1. Usage
zh_cn: 43.1. 用法

source: 44.1. Usage
zh_cn: 44.1. 用法

source: 44.2. Tasks
zh_cn: 44.2. 任务

source: 44.3. Distribution contents
zh_cn: 44.3. 分发内容

source: 45.1. Usage
zh_cn: 45.1. 用法

source: 45.2. Tasks
zh_cn: 45.2. 任务

source: 45.3. Convention properties
zh_cn: 45.3. 约定属性

source: 45.4. Including other resources in the distribution
zh_cn: 45.4. 在 distribution 中包含其他资源

source: 46.1. Usage
zh_cn: 46.1. 用法

source: 46.2. Tasks
zh_cn: 46.2. 任务

source: 46.3. Including other resources in the distribution
zh_cn: 46.3. 在 distribution 中包含其他资源

source: 47.1. Tasks
zh_cn: 47.1. 任务

source: 47.2. What to set up
zh_cn: 47.2. 要设置什么

source: 47.3.1. "pom" (Maven conversion)
zh_cn: 47.3.1. “pom”（Maven 转换）

source: 47.3. Build init types
zh_cn: 47.3. 构建初始化的类型

source: 48.1. Usage
zh_cn: 48.1. 用法

source: 48.2. Tasks
zh_cn: 48.2. 任务

source: 49.1. Usage
zh_cn: 49.1. 用法

source: 49.2. Tasks
zh_cn: 49.2. 任务

source: 49.3. Project layout
zh_cn: 49.3. 项目布局

source: 49.4. Dependency management
zh_cn: 49.4. 依赖管理

source: 49.5. Configuration
zh_cn: 49.5. 配置

source: 50.1.1. Flexible dependency management for migrations
zh_cn: 50.1.1. 为了迁移的灵活的依赖管理

source: 50.1.2. Dependency management and Java
zh_cn: 50.1.2. 依赖管理和 Java

source: 50.1. Introduction
zh_cn: 50.1. 介绍

source: 50.10.1. Implicit transitive dependencies
zh_cn: 50.10.1. 隐式传递依赖

source: 50.10. Strategies for transitive dependency management
zh_cn: 50.10. 传递依赖管理的策略

source: 50.2.1. Put the Version in the Filename (Version the jar)
zh_cn: 50.2.1. 在文件名中包含版本号（版本化 jar 文件）

source: 50.2.2. Manage transitive dependencies
zh_cn: 50.2.2. 管理传递依赖

source: 50.2.3. Resolve version conflicts
zh_cn: 50.2.3. 解决版本冲突的问题

source: 50.2.4. Use Dynamic Versions and Changing Modules
zh_cn: 50.2.4. 使用动态版本和变化的模块

source: 50.2. Dependency Management Best Practices
zh_cn: 50.2. 依赖管理的最佳实践

source: 50.3. Dependency configurations
zh_cn: 50.3. 依赖配置

source: 50.4.1.1. Depending on modules with multiple artifacts
zh_cn: 50.4.1.1. 依赖有多个 artifacts 的模块

source: 50.4.1. External module dependencies
zh_cn: 50.4.1. 外部模块依赖

source: 50.4.10. Dependency reports
zh_cn: 50.4.10. 依赖报告

source: 50.4.2. Client module dependencies
zh_cn: 50.4.2. 客户端模块依赖

source: 50.4.3. Project dependencies
zh_cn: 50.4.3. 项目依赖

source: 50.4.4. File dependencies
zh_cn: 50.4.4. 文件依赖

source: 50.4.5. Gradle API Dependency
zh_cn: 50.4.5. Gradle API 依赖

source: 50.4.6. Local Groovy Dependency
zh_cn: 50.4.6. 本地 Groovy 依赖

source: 50.4.7. Excluding transitive dependencies
zh_cn: 50.4.7. 排除传递依赖

source: 50.4.8. Optional attributes
zh_cn: 50.4.8. 可选属性

source: 50.4.9. Dependency configurations
zh_cn: 50.4.9. 依赖配置

source: 50.4. How to declare your dependencies
zh_cn: 50.4. 如何声明依赖

source: 50.5. Working with dependencies
zh_cn: 50.5. 使用依赖

source: 50.6.1. Maven central repository
zh_cn: 50.6.1. Maven 中央仓库

source: 50.6.2. Maven JCenter repository
zh_cn: 50.6.2. Maven JCenter 仓库

source: 50.6.3. Local Maven repository
zh_cn: 50.6.3. 本地 Maven 仓库

source: 50.6.4.1. Accessing password protected Maven repositories
zh_cn: 50.6.4.1. 访问密码保护的 Maven 仓库

source: 50.6.4. Maven repositories
zh_cn: 50.6.4. Maven 仓库

source: 50.6.5. Flat directory repository
zh_cn: 50.6.5. 平面的目录仓库

source: 50.6.6.1. Defining custom patterns for an Ivy repository
zh_cn: 50.6.6.1. 为一个 Ivy 存储库定义自定义的模式

source: 50.6.6.2. Ivy repository with Maven compatible layout
zh_cn: 50.6.6.2. 使用 Maven 兼容布局的 Ivy 仓库

source: 50.6.6.3. Defining different artifact and Ivy file locations for an Ivy repository
zh_cn: 50.6.6.3. 为一个 Ivy 仓库定义不同的 artifact 和 Ivy 文件位置

source: 50.6.6.4. Accessing password protected Ivy repositories
zh_cn: 50.6.6.4. 访问密码保护的 Ivy 仓库

source: 50.6.6. Ivy repositories
zh_cn: 50.6.6. Ivy 存储库

source: 50.6.7. Working with repositories
zh_cn: 50.6.7. 使用仓库

source: 50.6.8. More about Ivy resolvers
zh_cn: 50.6.8. 更多关于 Ivy 解析器的信息

source: 50.6. Repositories
zh_cn: 50.6. 仓库

source: 50.7. How dependency resolution works
zh_cn: 50.7. 依赖解析的工作原理

source: 50.8.1. Forcing a particular module version
zh_cn: 50.8.1. 强制一个特定模块的版本

source: 50.8.2.1. Modelling releaseable units
zh_cn: 50.8.2.1. 模块化可发布的单位

source: 50.8.2.2. Implement a custom versioning scheme
zh_cn: 50.8.2.2. 实现一个自定义的版本方案

source: 50.8.2.3. Blacklisting a particular version with a replacement
zh_cn: 50.8.2.3. 黑名单替换特定版本

source: 50.8.2.4. Substituting a dependency module with a compatible replacement
zh_cn: 50.8.2.4. 使用一个兼容模块替换一个依赖模块

source: 50.8.2. Using dependency resolve rules
zh_cn: 50.8.2. 使用依赖解析规则

source: 50.8.3. Enabling Ivy dynamic resolve mode
zh_cn: 50.8.3. 启用 Ivy 动态解析模式

source: 50.8.4. Component metadata rules
zh_cn: 50.8.4. 组件元数据规则

source: 50.8. Fine-tuning the dependency resolution process
zh_cn: 50.8. 微调依赖解析过程

source: 50.9.1.1. Separate metadata cache
zh_cn: 50.9.1.1. 单独的元数据缓存

source: 50.9.1.2. Repository caches are independent
zh_cn: 50.9.1.2. 仓库缓存是独立的

source: 50.9.1.3. Artifact reuse
zh_cn: 50.9.1.3. 构件重用

source: 50.9.1.4. Checksum based storage
zh_cn: 50.9.1.4. 基于校验和的存储

source: 50.9.1.5. Cache Locking
zh_cn: 50.9.1.5. 缓存锁

source: 50.9.1. Key features of the Gradle dependency cache
zh_cn: 50.9.1. Gradle 依赖缓存的主要特点

source: 50.9.2.1. Offline
zh_cn: 50.9.2.1. 离线

source: 50.9.2.2. Refresh
zh_cn: 50.9.2.2. 刷新

source: 50.9.2. Command line options to override caching
zh_cn: 50.9.2. 重写缓存的命令行选项

source: 50.9.3. Fine-tuned control over dependency caching
zh_cn: 50.9.3. 依赖缓存的微调控制

source: 50.9. The dependency cache
zh_cn: 50.9. 依赖缓存

source: 51.1. Introduction
zh_cn: 51.1. 介绍

source: 51.2. Artifacts and configurations
zh_cn: 51.2. 构件和配置

source: 51.3.2. File artifacts
zh_cn: 51.3.2. 文件构件

source: 51.3. Declaring artifacts
zh_cn: 51.3. 声明构件

source: 51.4. Publishing artifacts
zh_cn: 51.4 发布构件

source: 51.5. More about project libraries
zh_cn: 51.5. 更多关于项目库的内容

source: 52.1. Usage
zh_cn: 52.1. 用法

source: 52.2. Tasks
zh_cn: 52.2. 任务

source: 52.3. Dependency management
zh_cn: 52.3. 依赖管理

source: 52.4. Convention properties
zh_cn: 52.4. 约定属性

source: 52.5. Convention methods
zh_cn: 52.5. 约定方法

source: 52.6.1. Introduction
zh_cn: 52.6.1. 介绍

source: 52.6.2. Deploying to a Maven repository
zh_cn: 52.6.2. 部署到 Maven 仓库

source: 52.6.3. Installing to the local repository
zh_cn: 52.6.3. 安装到本地仓库

source: 52.6.4.1. Multiple artifacts per project
zh_cn: 52.6.4.1. 一个项目多个构件

source: 52.6.4.2. Dependency mapping
zh_cn: 52.6.4.2. 依赖映射

source: 52.6.4. Maven POM generation
zh_cn: 52.6.4. Maven POM 生成

source: 52.6. Interacting with Maven repositories
zh_cn: 52.6. 与 Maven 仓库的交互

source: 53.1. Usage
zh_cn: 53.1. 用法

source: 53.2. Signatory credentials
zh_cn: 53.2. 签名凭证

source: 53.3.1. Signing Configurations
zh_cn: 53.3.1. 签名配置

source: 53.3.2. Signing Tasks
zh_cn: 53.3.2. 签名任务

source: 53.3.3. Conditional Signing
zh_cn: 53.3.3. 有条件的签名

source: 53.3. Specifying what to sign
zh_cn: 53.3. 指定要签名的内容

source: 53.4. Publishing the signatures
zh_cn: 53.4. 发布签名

source: 53.5. Signing POM files
zh_cn: 53.5. 签名 POM 文件

source: 54.1. Tool chain support
zh_cn: 54.1. 工具链支持

source: 54.10. Visual Studio IDE integration
zh_cn: 54.10. Visual Studio IDE 集成

source: 54.11.1. CUnit sources
zh_cn: 54.11.1. CUnit 源码

source: 54.11.2. Building CUnit executables
zh_cn: 54.11.2. 构建 CUnit 可执行文件

source: 54.11.3. Running CUnit tests
zh_cn: 54.11.3. 运行 CUnit 测试

source: 54.11. CUnit support
zh_cn: 54.11. CUnit 支持

source: 54.2. Component model
zh_cn: 54.2. 组件模型

source: 54.3.1. Working with shared libraries
zh_cn: 54.3.1. 使用共享库

source: 54.3. Tasks
zh_cn: 54.3. 任务

source: 54.4.1. C++ sources
zh_cn: 54.4.1. C++ 源代码

source: 54.4.2. C sources
zh_cn: 54.4.2. C 源代码

source: 54.4.3. Assembler sources
zh_cn: 54.4.3. 汇编代码

source: 54.4.4. Objective-C sources
zh_cn: 54.4.4. Objective-C 源码

source: 54.4.5. Objective-C++ sources
zh_cn: 54.4.5. Objective-C++ 源码

source: 54.4. Core language support: C, C++, Assembler, Objective-C and Objective-C++
zh_cn: 544.核心语言支持: C、C++、汇编，Objective-C和Objective-C++

source: 54.5. Configuring the compiler, assembler and linker
zh_cn: 54.5. 配置编译器，汇编器和连接器

source: 54.6. Windows Resources
zh_cn: 54.6. Windows Resource

source: 54.7.1. Dependencies within the same project
zh_cn: 54.7.1. 同一项目的依赖

source: 54.7.2. Project Dependencies
zh_cn: 54.7.2. 项目依赖

source: 54.7. Library Dependencies
zh_cn: 54.7. 库依赖

source: 54.8.1. Build types
zh_cn: 54.8.1. 构建类型

source: 54.8.2. Platform
zh_cn: 54.8.2. 平台
